app/views/favorites/_favorite-btn.html.erb

      <%= link_to book_favorites_path(book.id), method: :delete, remote: true do %>
        ♥<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

      <%= link_to book_favorites_path(book.id), method: :post, remote: true do %>
        ♡<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]