app/views/books/_index.html.erb

SELECT "books".* FROM "books"
---
    <td>
    <%= "#{book.book_comments.count} コメント" %>